{"@context": "http://schema.org", "@type": "SoftwareSourceCode", "isPartOf": {"@type": "WebApplication", "applicationCategory": "Computational Modeling Software Repository", "operatingSystem": "Any", "name": "CoMSES Model Library", "url": "https://www.comses.net/codebases"}, "publisher": {"@id": "https://www.comses.net", "@type": "Organization", "name": "CoMSES Net", "url": "https://www.comses.net"}, "provider": {"@id": "https://www.comses.net", "@type": "Organization", "name": "CoMSES Net", "url": "https://www.comses.net"}, "name": "Phase Transition in the Social Impact Model of Opinion Formation in Scale-Free Networks: The Social Power Effect", "abstract": "", "description": "This model is implemented to study phase transition in the social impact model of opinion formation. A random parameter is considered as the system noise, indicating the individual's inexplicable opinion changes. This noise could be an indicator of any other influential factors, such as public media, affects, and emotions.\nScale-free random networks have been used as interaction network topology. Two scenarios have been implemented: the original social impact model and a similar model using the concept of social power based on the agents' node degrees in the interaction network as an estimation for their persuasiveness and supportiveness strengths.\nThe  simulation results show how opinion phases, including majority and non-majority, are formed in terms of the initial population of agents in opinion groups and noise levels. Two factors affect the system phase in equilibrium when the noise level increases: breaking up more segregated groups and dominance of stochastic behavior of the agents on their deterministic behavior. In the high enough noise levels, the system reaches a non-majority phase in equilibrium, regardless of the initial combination of opinion groups. In relatively low noise levels, the original model and the model whose agents' strengths are proportional to their centrality have different behaviors. The presence of a few high-connected influential leaders in the latter model consequences a different behavior in reaching equilibrium phase and different thresholds of noise levels for phase transitions.", "version": "1.0.0", "targetProduct": {"@type": "SoftwareApplication", "operatingSystem": "platform_independent", "applicationCategory": "Computational Model", "screenshot": "https://www.comses.net/images/VZ_kyNP8i5meLQzXwPInb_utn6g=/590/fill-205x115/03623141-8513-41ae-b212-03e286dd7fa9/media/sharedlibrary03623141-8513-41ae.png"}, "programmingLanguage": [{"@type": "ComputerLanguage", "name": "Pyton"}], "author": [{"@type": "Person", "givenName": "", "familyName": "Mansouri", "email": "amansuri20@yahoo.com"}], "identifier": "https://www.comses.net/codebases/03623141-8513-41ae-b212-03e286dd7fa9/releases/1.0.0/", "dateCreated": "2020-01-06T10:15:36.974485+00:00", "dateModified": "2020-01-06T20:12:40.796322+00:00", "keywords": ["phase transition", "agent-based model", "dynamics opinion"], "runtimePlatform": ["mesa"], "url": "https://www.comses.net/codebases/03623141-8513-41ae-b212-03e286dd7fa9/releases/1.0.0/", "citation": [{"@type": "CreativeWork", "text": "Mansouri, Alireza, Taghiyareh, Fattaneh, Phase Transition in the Social Impact Model of Opinion Formation in Scale-Free Networks: The Social Power Effect.\nWith Referees"}], "license": "http://www.gnu.org/licenses/gpl-3.0.html", "releaseNotes": "The model with enough details and pseudocode is described in the manuscript currently under review by JASSS.\n\nGiude to run the model:\nThe model is coded in Python, using 'mesa' pachage.\n\nThe main.py file contains parameters to be set. The default values are those used in the manuscript under review. After running the model, output files are generated, which are input files for generate_diagrams to generate diagrams. The folder 'Last_Run' is defined to contain the input files and output diagrams of generate_dagram main file.\n\nThe model results and related diagrams are also uploaded.\n\n\nEnjoy modelling\n", "@id": "https://www.comses.net/codebases/03623141-8513-41ae-b212-03e286dd7fa9/releases/1.0.0/"}